app/Controllers/Home.php

    public function processData()
    {
        $id_periode = $this->request->getPost('id_periode');
        $jml_diterima = $this->request->getPost('jml_diterima');
        // Load the SiswaModel
        $siswaModel = new SiswaModel();
        $hasilModel = new HasilModel();

        // Fetch all data from the SiswaModel
        $siswaData = $siswaModel->findAll();
        $siswaDataAsli = $siswaModel->findAll();
---
SELECT *
FROM `siswa`


        // Lakukan perhitungan jika ada siswa yang belum ada di hasilData
        if (!empty($siswaData)) {
            $existingData = $hasilModel->where('id_periode', $id_periode)->findAll();
---
SELECT *
FROM `hasil`
WHERE `id_periode` = '2'

            $selectedPeriode = $id_periode;

            // Fetch all periode data from the database
            $periodeOptions = $periodeModel->find($selectedPeriode);
---
SELECT *
FROM `periode`
WHERE `periode`.`id` = '2'