app/Controllers/Home.php

    public function index()
    {
        // Load the SiswaModel
        $siswaModel = new SiswaModel();

        // Fetch all data from the SiswaModel
        $data['siswa'] = $siswaModel->findAll();
---
SELECT *
FROM `siswa`

    public function tambahdata()
    {
        // Dapatkan nilai dari form
        $pemberkasanValues = $this->request->getPost('pemberkasan');

        // Ubah array menjadi string (misalnya, dengan pemisah koma)
        $pemberkasan = implode(', ', $pemberkasanValues);
        $totalPemberkasan = count($pemberkasanValues);

        // Setelah itu, masukkan ke dalam array data yang akan disimpan
        $data = [
            'nama' => $this->request->getPost('nama'),
            'pemberkasan' => $pemberkasan,
            'prestasi' => $this->request->getPost('prestasi'),
            'status' => $this->request->getPost('status_anak'),
            'pk_ortu' => $this->request->getPost('pekerjaan_ortu'),
            'ph_ortu' => $this->request->getPost('penghasilan_ortu'),
            'tg_ortu' => $this->request->getPost('tanggungan_ortu'),
        ];

        // Insert the data into the database using the SiswaModel
        $siswaModel = new SiswaModel();
        $siswaModel->insert($data);
---
INSERT INTO `siswa` (`nama`, `pemberkasan`, `prestasi`, `status`, `pk_ortu`, `ph_ortu`, `tg_ortu`) VALUES ('khusni', '1|Kartu KIP', '1|Tidak ada Prestasi', '1|Anak Kandumg', '4|Buruh', '5|Tidak Bekerja', '3|3 Orang')

    public function deleteData($id)
    {
        // Panggil model untuk menghapus data berdasarkan ID
        $siswaModel = new SiswaModel();
        $siswaModel->delete($id);
---
DELETE FROM `siswa`
WHERE `id` IN ('5')

    public function edit($id)
    {
        $siswaModel = new SiswaModel();
        $data['siswa'] = $siswaModel->find($id);
---
SELECT *
FROM `siswa`
WHERE `siswa`.`id` = '11'

    public function processData()
    {
        // Load the SiswaModel
        $siswaModel = new SiswaModel();
        $hasilModel = new HasilModel();

        // Fetch all data from the SiswaModel
        $siswaData = $siswaModel->findAll();
---
SELECT *
FROM `siswa`