app/Models/HasilModel.php

SELECT *
FROM `hasil`
LEFT JOIN `periode` ON `hasil`.`id_periode` = `periode`.`id`
WHERE `id_periode` = '2'
---
    public function getAllHasilWithPeriode($idPeriode = null)
    {
        $builder = $this->db->table('hasil');

        // Apply periode filter if $idPeriode is provided
        if ($idPeriode !== null) {
            $builder->where('id_periode', $idPeriode);
        }

        // Join with periode table
        $builder->join('periode', 'hasil.id_periode = periode.id', 'left');

        // Fetch all hasil data
        return $builder->get()->getResultArray();

INSERT INTO `hasil` (`nama`, `skor`, `tgl`, `id_periode`, `diterima`) VALUES ('farhan', 2.675, '2023-12-09 13:57:29', '2', 'YA')
---
    public function insertHasil($data)
    {
        return $this->insert($data);

DELETE FROM `hasil`
WHERE `id_periode` = '2'
---
    public function deleteHasilByPeriode($idPeriode)
    {
        return $this->where('id_periode', $idPeriode)->delete();