app/Models/PeriodeModel.php

    public function getAllPeriode()
    {
        return $this->findAll();
---
SELECT *
FROM `periode`