app/Models/SiswaModel.php

    public function getAllSiswaWithPeriode()
    {
        return $this->findAll();
---
SELECT *
FROM `siswa`